app/views/tickets/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= ticket.issue %></td>
        <td><%= User.find(ticket.created_by).username %></td>