app/views/tickets/show.html.erb

  <strong>Created by:</strong>
  <%= User.find(@ticket.created_by).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]