app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE (cast(id) LIKE '%1%') ORDER BY created_at DESC
---
  def index
    @tickets = Ticket.all

INSERT INTO "tickets" ("title", "issue", "created_by", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "This is a test case"], ["issue", "ABCDEFG"], ["created_by", 1], ["status", 0], ["created_at", "2019-04-06 10:35:13.668217"], ["updated_at", "2019-04-06 10:35:13.668217"]]
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "status" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["status", 2], ["updated_at", "2019-04-06 10:46:14.338523"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)