app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "firstname", "lastname", "address", "postalcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "groups" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["groups", "1"], ["updated_at", "2019-04-04 15:06:30.816741"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)